```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.stateless.module.cw_metric_alarms.aws_cloudwatch_metric_alarm.http-500[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "http-500" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-alarms",
        ]
      + alarm_description                     = "HTTP 500 Errors detected in APP-ENV: bfd-test over a 5m period."
      + alarm_name                            = "bfd-test-http-500"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 1
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "http-requests/count/http-500"
      + namespace                             = "bfd-test/bfd-server"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-ok",
        ]
      + period                                = 300
      + statistic                             = "Maximum"
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.stateless.module.cw_metric_alarms.aws_cloudwatch_metric_alarm.http-requests-latency-fhir-eob-4s[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "http-requests-latency-fhir-eob-4s" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-alarms",
        ]
      + alarm_description                     = "HTTP EOB Request Latency exceeds 4s (p90) in APP-ENV: bfd-test over a 15m period."
      + alarm_name                            = "bfd-test-http-requests-latency-fhir-eob"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + extended_statistic                    = "p90"
      + id                                    = (known after apply)
      + metric_name                           = "http-requests/latency/fhir/eob"
      + namespace                             = "bfd-test/bfd-server"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-ok",
        ]
      + period                                = 900
      + threshold                             = 4000
      + treat_missing_data                    = "notBreaching"
    }

  # module.stateless.module.cw_metric_alarms.aws_cloudwatch_metric_alarm.http-requests-latency-fhir-eob-6s[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "http-requests-latency-fhir-eob-6s" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-alarms",
        ]
      + alarm_description                     = "HTTP EOB Request Latency exceeds 6s (p99) in APP-ENV: bfd-test over a 1h period."
      + alarm_name                            = "bfd-test-http-requests-latency-fhir-eob"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + extended_statistic                    = "p99"
      + id                                    = (known after apply)
      + metric_name                           = "http-requests/latency/fhir/eob"
      + namespace                             = "bfd-test/bfd-server"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-ok",
        ]
      + period                                = 3600
      + threshold                             = 6000
      + treat_missing_data                    = "notBreaching"
    }

  # module.stateless.module.cw_metric_alarms.aws_cloudwatch_metric_alarm.mct-query-duration[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "mct-query-duration" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-alarms",
        ]
      + alarm_description                     = "HTTP EOB Request Latency exceeds 6s (p99) in APP-ENV: bfd-test over a 1h period."
      + alarm_name                            = "bfd-test-mct-query-duration"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + extended_statistic                    = "p99"
      + id                                    = (known after apply)
      + metric_name                           = "mct-query-duration"
      + namespace                             = "bfd-test/bfd-server"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-ok",
        ]
      + period                                = 3600
      + threshold                             = 6000
      + treat_missing_data                    = "notBreaching"
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_group.access will be created
  + resource "aws_cloudwatch_log_group" "access" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/bfd/test/bfd-server/access.txt"
      + retention_in_days = 0
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_group.gc will be created
  + resource "aws_cloudwatch_log_group" "gc" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/bfd/test/bfd-server/gc.log"
      + retention_in_days = 0
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_group.messages will be created
  + resource "aws_cloudwatch_log_group" "messages" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/bfd/test/bfd-server/messages.json"
      + retention_in_days = 0
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_group.newrelic_agent will be created
  + resource "aws_cloudwatch_log_group" "newrelic_agent" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/bfd/test/bfd-server/newrelic_agent.log"
      + retention_in_days = 0
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-count" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access.txt"
      + name           = "bfd-test/bfd-server/http-requests/count"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request, query_string, status_code, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + default_value = "0"
          + name          = "http-requests/count"
          + namespace     = "bfd-test/bfd-server"
          + value         = "1"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-500[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-count-500" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access"
      + name           = "bfd-test/bfd-server/http-requests/count/http-500"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request, query_string, status_code = 500, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + default_value = "0"
          + name          = "http-requests/count/http-500"
          + namespace     = "bfd-test/bfd-server"
          + value         = "1"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-coverage[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-count-coverage" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access.txt"
      + name           = "bfd-test/bfd-server/http-requests/count/coverage"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request = \"*/Coverage*\", query_string, status_code, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + default_value = "0"
          + name          = "http-requests/count/coverage"
          + namespace     = "bfd-test/bfd-server"
          + value         = "1"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-eob[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-count-eob" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access"
      + name           = "bfd-test/bfd-server/http-requests/count/eob"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request = \"*/ExplanationOfBenefit*\", query_string, status_code, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + default_value = "0"
          + name          = "http-requests/count/eob"
          + namespace     = "bfd-test/bfd-server"
          + value         = "1"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-metadata[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-count-metadata" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access"
      + name           = "bfd-test/bfd-server/http-requests/count/meta-data"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request = \"*/metadata*\", query_string, status_code, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + default_value = "0"
          + name          = "http-requests/count/metadata"
          + namespace     = "bfd-test/bfd-server"
          + value         = "1"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-not-2xx[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-count-not-2xx" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access"
      + name           = "bfd-test/bfd-server/http-requests/count/not-2xx"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request, query_string, status_code != 2*, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + default_value = "0"
          + name          = "http-requests/count/not-2xx"
          + namespace     = "bfd-test/bfd-server"
          + value         = "1"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-patient[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-count-patient" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access"
      + name           = "bfd-test/bfd-server/http-requests/count/patient"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request = \"*/Patient*\", query_string, status_code, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + default_value = "0"
          + name          = "http-requests/count/patient"
          + namespace     = "bfd-test/bfd-server"
          + value         = "1"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-patient-patientSearchById[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-count-patient-patientSearchById" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access"
      + name           = "bfd-test/bfd-server/http-requests/count/patient/patientSearchById"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request = \"*/Patient*_id=*\", query_string, status_code, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + default_value = "0"
          + name          = "http-requests/count/patient/patientSearchById"
          + namespace     = "bfd-test/bfd-server"
          + value         = "1"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-patient-patientSearchByIdentifier[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-count-patient-patientSearchByIdentifier" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access"
      + name           = "bfd-test/bfd-server/http-requests/count/patient/patientSearchByIdentifier"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request = \"*/Patient*identifier=*hicnHash*\", query_string, status_code, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + default_value = "0"
          + name          = "http-requests/count/patient/patientSearchByIdentifier"
          + namespace     = "bfd-test/bfd-server"
          + value         = "1"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-latency[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-latency" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access"
      + name           = "bfd-test/bfd-server/http-requests/latency"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request, query_string, status_code, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + name      = "http-requests/latency"
          + namespace = "bfd-test/bfd-server"
          + value     = "$duration_milliseconds"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-latency-fhir-coverage[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-latency-fhir-coverage" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access"
      + name           = "bfd-test/bfd-server/http-requests/latency/fhir/coverage"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request = \"*/Coverage*\", query_string, status_code, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + name      = "http-requests/latency/fhir/coverage"
          + namespace = "bfd-test/bfd-server"
          + value     = "$duration_milliseconds"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-latency-fhir-eob[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-latency-fhir-eob" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access"
      + name           = "bfd-test/bfd-server/http-requests/latency/fhir/eob"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request = \"*/ExplanationOfBenefit*\", query_string, status_code, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + name      = "http-requests/latency/fhir/eob"
          + namespace = "bfd-test/bfd-server"
          + value     = "$duration_milliseconds"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-latency-fhir-patient[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-latency-fhir-patient" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access"
      + name           = "bfd-test/bfd-server/http-requests/latency/fhir/patient"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request = \"*/Patient*\", query_string, status_code, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + name      = "http-requests/latency/fhir/patient"
          + namespace = "bfd-test/bfd-server"
          + value     = "$duration_milliseconds"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-latency-over-600[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "http-requests-latency-over-600" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access"
      + name           = "bfd-test/bfd-server/http-requests/latency/over-600"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user, timestamp, request, query_string, status_code, bytes, duration_milliseconds > 6000, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + default_value = "0"
          + name          = "http-requests/latency/over-600"
          + namespace     = "bfd-test/bfd-server"
          + value         = "1"
        }
    }

  # module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.mct_query_time[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "mct_query_time" {
      + id             = (known after apply)
      + log_group_name = "/bfd/test/bfd-server/access.txt"
      + name           = "bfd-test/bfd-server/mct-query-time"
      + pattern        = "[remote_host_name, remote_logical_username, remote_authenticated_user=*mct-prod-client, timestamp, request, query_string, status_code, bytes, duration_milliseconds, original_query_id, original_query_counter, original_query_timestamp, developer, developer_name, application_id, application, user_id, user, beneficiary_id]"

      + metric_transformation {
          + name      = "mct-query-duration"
          + namespace = "bfd-test/bfd-server"
          + value     = "$duration_milliseconds"
        }
    }

  # module.stateless.module.bfd_pipeline.module.ec2_instance.aws_instance.main must be replaced
-/+ resource "aws_instance" "main" {
        ami                          = "ami-0bf2b6c1ce2029516"
      ~ arn                          = "arn:aws:ec2:us-east-1:577373831711:instance/i-0c49a33d9f9f965a4" -> (known after apply)
        associate_public_ip_address  = false
        availability_zone            = "us-east-1b"
      ~ cpu_core_count               = 4 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
        ebs_optimized                = true
        get_password_data            = false
      + host_id                      = (known after apply)
        iam_instance_profile         = "bfd-test-etl-profile"
      ~ id                           = "i-0c49a33d9f9f965a4" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
        instance_type                = "m5.2xlarge"
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
        key_name                     = "bfd-test"
        monitoring                   = true
      + network_interface_id         = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0697c39d4265e2d18" -> (known after apply)
      ~ private_dns                  = "ip-10-235-21-102.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.235.21.102" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ security_groups              = [] -> (known after apply)
        source_dest_check            = true
        subnet_id                    = "subnet-048c7b59678709fa4"
        tags                         = {
            "Environment" = "test"
            "Layer"       = "data"
            "Name"        = "bfd-test-etl"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "etl"
            "stack"       = "test"
        }
        tenancy                      = "default"
      ~ user_data                    = "59402c69c5269b78f6944bb694b5ca36953e4106" -> "25cd24eb4a4709834c1cf5a692fe1f5bedbfbc9e" # forces replacement
        volume_tags                  = {
            "Environment" = "test"
            "Layer"       = "data"
            "Name"        = "bfd-test-etl"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "etl"
            "snapshot"    = "true"
            "stack"       = "test"
        }
        vpc_security_group_ids       = [
            "sg-01b241e4a5490c632",
            "sg-0a1a9d02fe5ac3891",
            "sg-0ea67e016d7cfd91e",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
            delete_on_termination = true
            encrypted             = true
          ~ iops                  = 300 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:577373831711:key/7dcca42a-da93-40b1-a4a8-2eb10050f449" -> "alias/bfd-test-cmk" # forces replacement
          ~ volume_id             = "vol-07394bb3d4adaec10" -> (known after apply)
            volume_size           = 100
            volume_type           = "gp2"
        }
    }

Plan: 24 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```